## Data Frame, serilerin birleştirilerek kullanımını ifade eder.

In [1]:
import numpy as np
import pandas as pd

In [8]:
data = np.random.randn(4,3)

In [9]:
data

array([[ 0.46525187, -0.37294913, -0.28804982],
       [-0.14783588, -1.53629298,  1.19070466],
       [ 0.31758995,  0.74621314,  1.74228269],
       [ 0.15409604,  1.00198616,  0.23477174]])

In [10]:
dataFrame = pd.DataFrame(data)

In [11]:
dataFrame

          0         1         2
0  0.465252 -0.372949 -0.288050
1 -0.147836 -1.536293  1.190705
2  0.317590  0.746213  1.742283
3  0.154096  1.001986  0.234772

In [12]:
yeniDataFrame = pd.DataFrame(data, index=["Atil", "Arda", "Esil", "Mehmet"], columns = ["Maas", "Yas","Calisma Saati"])

In [13]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.465252 -0.372949      -0.288050
Arda   -0.147836 -1.536293       1.190705
Esil    0.317590  0.746213       1.742283
Mehmet  0.154096  1.001986       0.234772

In [14]:
yeniDataFrame["Yas"]

Atil     -0.372949
Arda     -1.536293
Esil      0.746213
Mehmet    1.001986
Name: Yas, dtype: float64

In [16]:
yeniDataFrame[["Yas","Maas"]]

             Yas      Maas
Atil   -0.372949  0.465252
Arda   -1.536293 -0.147836
Esil    0.746213  0.317590
Mehmet  1.001986  0.154096

In [18]:
yeniDataFrame.loc["Atil"] #loc = location

Maas             0.465252
Yas             -0.372949
Calisma Saati   -0.288050
Name: Atil, dtype: float64

In [19]:
yeniDataFrame.loc["Esil"]

Maas             0.317590
Yas              0.746213
Calisma Saati    1.742283
Name: Esil, dtype: float64

In [20]:
yeniDataFrame.iloc[1] # iloc = indexlocation

Maas            -0.147836
Yas             -1.536293
Calisma Saati    1.190705
Name: Arda, dtype: float64

## Data Frame Index

In [21]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + 60

In [22]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.465252 -0.372949      -0.288050       59.627051
Arda   -0.147836 -1.536293       1.190705       58.463707
Esil    0.317590  0.746213       1.742283       60.746213
Mehmet  0.154096  1.001986       0.234772       61.001986

In [24]:
yeniDataFrame.drop("Maas", axis=1) #column silmek için axis=1 kullanılır

             Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.372949      -0.288050       59.627051
Arda   -1.536293       1.190705       58.463707
Esil    0.746213       1.742283       60.746213
Mehmet  1.001986       0.234772       61.001986

In [36]:
yeniDataFrame.drop("Mehmet") #rowdaki(satır) bir seriyi silmek için kullanılır

          Maas       Yas  Calisma Saati
Atil  0.465252 -0.372949      -0.288050
Arda -0.147836 -1.536293       1.190705
Esil  0.317590  0.746213       1.742283

In [37]:
## drop ile silinen seriler kalıcı olarak silinmezler
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.465252 -0.372949      -0.288050
Arda   -0.147836 -1.536293       1.190705
Esil    0.317590  0.746213       1.742283
Mehmet  0.154096  1.001986       0.234772

In [ ]:
## kalıcı olarak silebilmek için;
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace=True)

In [41]:
yeniDataFrame ##emeklilik yasi kalıcı olarak silindi

            Maas       Yas  Calisma Saati
Atil    0.465252 -0.372949      -0.288050
Arda   -0.147836 -1.536293       1.190705
Esil    0.317590  0.746213       1.742283
Mehmet  0.154096  1.001986       0.234772

In [43]:
yeniDataFrame.loc["Atil"]["Yas"] veya yeniDataFrame.loc["Atil", "Yas"]

-0.3729491252884265

#

In [45]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.465252 -0.372949      -0.288050
Arda   -0.147836 -1.536293       1.190705
Esil    0.317590  0.746213       1.742283
Mehmet  0.154096  1.001986       0.234772

In [44]:
yeniDataFrame < 0

         Maas    Yas  Calisma Saati
Atil    False   True           True
Arda     True   True          False
Esil    False  False          False
Mehmet  False  False          False

In [46]:
booleanFrame = yeniDataFrame < 0
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil         NaN -0.372949       -0.28805
Arda   -0.147836 -1.536293            NaN
Esil         NaN       NaN            NaN
Mehmet       NaN       NaN            NaN